// Prepare records.
private _briefing = [["diary", "Брифінг", [
	["Ситуація", "Текст текст текст."],
	["Тайтл2", "Текст2 текст2 текст2."]
]],
["rules", "ПРАВИЛА", [
	["Головне", "Максимум взаємоповаги, мінімум мату."],
	["Очевидне", "Дюп, багоюз, чітерство, використання експлойтів і подібне матимуть наслідки."],
	["Атмосфера", "Підтримуйте атмосферу гри та ігрового світу. Якщо не хочете - відігрувати роль не обов'язково. Але про респавн, лут і т.д. теж кричати не варто."],
	["Баги", "Баги арми вважати аномаліями. Якщо велосипед при наїзді на камінь полетів в космос - ну не пощастило. Таке буває. Не наїжджайте на камені. :)"],
	["Мітки на мапі", "Не ставимо."],
	["Засоби зв'язку", "Під час гри єдиний засіб зв'язку між гравцями - ТС. Не треба писати в діскорді 'мене вбили там-то і там-то, допоможи'."],
	["PVP", "PVP відбувається ВИКЛЮЧНО за ЯВНОЇ згоди ВСІХ учасників процесу."],
	["OOC", "Питання що не вписуються в ігровий світ вирішуються за межами ігрового процесу - через глобальний чат або діскорд."],
	["Порушення", "Порушення правил караються на розсуд адміністрації проєкту та адміністрації спільноти Arma Ukraine."]
]],
["gameplay", "Ігролад", [
	["Ближній бій", "
		По замовчуванню:<br/>
		<br/>
		- ctrl+h - приготуватися до ближнього бою<br/>
		- space+[wasd] - ухилитися в відповідному напрямку<br/>
		- lmb - удар<br/>
		- rmb - блок<br/>
		<br/>
		Решту дивіться в розділі управління відповідного аддона.<br/>
	"],
	["Збереження прогресу", "
		Стан світу та вашого персонажу автоматично зберігається після виходу з серверу або завершення роботи серверу.<br/>
		<br/>
		УВАГА: з гри завжди варто виходити в безпечному місці. Інакше на наступному анонсі або після входу є шанс опинитися в натовпі ворогів або всередині аномалії з відповідними наслідками.<br/>
	"],
	["Ресурси", "
		В розробці.
	"]
]],
["thanks", "Подяка", [
	["Спільнота Arma Ukraine", "Натхнення, поради, підтримка і всебічна допомога.<br/>discord.gg/DYA3dNS"],
	["ASADA", "Тестування, ЛОР, організаційні питання. І моральна підтримка. :)"],
	["Brezerk", "Ідеї та скрипти.<br/>https// brezblock.org.ua/"], 
	["ch_yaroslav", "Ідеї та скрипти. Українські гривні."],
	["Fenix", "Ідеї та скрипти."],
	["Спільнота Gruppe Adler", "Скрипти запису місії та магазину.<br/>github.com/gruppe-adler"]
]]
];

// Populate records.
{
	private _subject = _x#0;
	private _records = _x#2;
	reverse _records;
	player createDiarySubject [_subject, _x#1];
	{
		player createDiaryRecord [_subject, [_x#0, _x#1]];
	} forEach (_records);
} forEach _briefing;