// Prepare records.
private _briefing = [["diary", "Брифінг", [
	["Передмова", "
		У 2019 році світ приголомшила страшна новина, в Китаї з біологічної лабораторії за невідомих обставин стався витік вірусного агенту. Вірус швидко ширився світом і постійно мутував, з'явилися перші загиблі. Вже через рік весь світ опинився в карантині.<br/>
		<br/>
		Спочатку, люди швидко вмирали. Але після чергової хвилі мутацій почали поставати з мертвих.<br/>
		<br/>
		Ваша історія почаласі в фільтраційному таборі. Вас, як і пару десятків таких же невдах, завантажили в автобус і повезли в аеропорт. Обіцяли евакуацію та безпечне місце для проживання. Але, як завжди, все пішло не по плану: напад мародерів, обстріл автобуса, поранення, смерть військових які вас супроводжували... Події посіяли паніку. Водій тис на газ не розбираючи дороги, але, згодом, від кровотечі та отриманих поранень. Ви їхали далі допоки ставало сил і бензину і зупинилися біля невеличкого покинутого будинку в кінці дороги у підніжжя гір.<br/>
		<br/>
		За кілька місяців, на місцевості почали з'являтися просторові, гравітаційні, хімічні аномалії та різного роду біологічні мутації пов'язані чи-то з вірусом, чи може з чимось іншим. Подейкують, що це пов'язано з науковими експериментами, які вийшли з-під контролю. Хрін зна, що сталоися з тим мініатюрним генератором чорних дір що заповнював усі новинарні останніми тижнями до відомих подій. Як, власне, і з дюжиною інших аналогічних проєктів.<br/>
		<br/>
		Йшли тижні, місяці, роки. Поволі зникали зв'язок, електрика, централізоване водопостачання. Що далі? Як бути? Куди йти? Як вижити?..<br/>
	"],
	["Глава 1: Битися, чи тікати?", "
		Холодного весняного ранку розбудив дозорний з блідим обличчям і острахом в очах. Полишеним надії голосом він повідомив: йде орда. Маємо часу до ранку на збори і організацію оборони. Тре тримати в голові: остання мутація вірусу стала смертельною. Один укус - і жертва, за кілька хвилин, приєднується до натовпу голодних ходячих мерців. Досвід говорить, що залишитися без стін навколо на ніч чи зайти занадто глибоко в ліс означатиме вірну смерть. Йти більше нема куди. Маємо битися і захищати свій дім.<br/>
		<br/>
		Якщо виживемо - брати просили зайти і принести їм металолому. Обіцяли подарунок взамін...<br/>
	"],
	["Післямова", "Будь-яке життя закінчується смертю. Чиєсь - раніше, чиєсь - пізніше. Але результат - завжди один."]
]],
["rules", "ПРАВИЛА", [
	["Головне", "Максимум взаємоповаги, мінімум мату."],
	["Очевидне", "Дюп, багоюз, чітерство, використання експлойтів і подібне матимуть наслідки."],
	["Атмосфера", "Підтримуйте атмосферу гри та ігрового світу. Якщо не хочете - відігрувати роль не обов'язково. Але про респавн, лут і т.д. теж кричати не варто."],
	["Баги", "Баги арми вважати аномаліями. Якщо велосипед при наїзді на камінь полетів в космос - ну не пощастило. Таке буває. Не наїжджайте на камені. :)"],
	["Мітки на мапі", "Не ставимо."],
	["Засоби зв'язку", "Під час гри єдиний засіб зв'язку між гравцями - ТС. Не треба писати в діскорді 'мене вбили там-то і там-то, допоможи'."],
	["PVP", "PVP відбувається ВИКЛЮЧНО за ЯВНОЇ згоди ВСІХ учасників процесу."],
	["OOC", "Питання що не вписуються в ігровий світ вирішуються за межами ігрового процесу - через глобальний чат або діскорд."],
	["Порушення", "Порушення правил караються на розсуд адміністрації проєкту та адміністрації спільноти Arma Ukraine."]
]],
["gameplay", "Ігролад", [
	["Ближній бій", "
		По замовчуванню:<br/>
		<br/>
		- ctrl+h - приготуватися до ближнього бою<br/>
		- space+[wasd] - ухилитися в відповідному напрямку<br/>
		- lmb - удар<br/>
		- rmb - блок<br/>
		<br/>
		Решту дивіться в розділі управління відповідного аддона.<br/>
	"],
	["Збереження прогресу", "
		Стан світу та вашого персонажу автоматично зберігається після виходу з серверу або завершення роботи серверу.<br/>
		<br/>
		УВАГА: з гри завжди варто виходити в безпечному місці. Інакше на наступному анонсі або після входу є шанс опинитися в натовпі ворогів або всередині аномалії з відповідними наслідками.<br/>
	"],
	["Ресурси", "
		В розробці.
	"]
]],
["thanks", "Подяка", [
	["Спільнота Arma Ukraine", "Натхнення, поради, підтримка і всебічна допомога.<br/>discord.gg/DYA3dNS"],
	["ASADA", "Тестування, ЛОР, організаційні питання. І моральна підтримка. :)"],
	["Brezerk", "Ідеї та скрипти.<br/>https// brezblock.org.ua/"], 
	["ch_yaroslav", "Ідеї та скрипти. Українські гривні."],
	["Fenix", "Ідеї та скрипти."],
	["Спільнота Gruppe Adler", "Скрипти запису місії та магазину.<br/>github.com/gruppe-adler"]
]]
];

// Populate records.
{
	private _subject = _x#0;
	private _records = _x#2;
	reverse _records;
	player createDiarySubject [_subject, _x#1];
	{
		player createDiaryRecord [_subject, [_x#0, _x#1]];
	} forEach (_records);
} forEach _briefing;